USE OutpatientChargesBase
IF OBJECT_ID('tb_Department') IS NOT NULL
DROP TABLE tb_Department;
GO
CREATE TABLE tb_Department
	(DepartmentNo
		INT IDENTITY(1,1)/*IDENTITY(1,1)：自增长，起始值1，增量1*/
		NOT NULL
	CONSTRAINT pk_Department_DepartmentNo
		PRIMARY KEY(DepartmentNo)
	,Name
		VARCHAR(100)
	,Introduction
		VARCHAR(1000))
		
INSERT INTO tb_Department
	(Name,Introduction)
	VALUES
	('心血管内科','诊治高血压、冠心病等心血管疾病'),
	('消化内科','胃肠道疾病的诊断和治疗'),
	('神经内科','处理脑部疾病和神经系统疾病'),
	('呼吸内科','呼吸系统疾病的诊疗'),
	('内分泌科','内分泌系统的相关疾病'),
	('风湿免疫科','风湿免疫系统的相关疾病'),
	('普通外科','颈部疾病、乳腺疾病、肝硬化门脉高压症以及胰腺疾病等多个专业范围'),
	('肝胆胰外科','肝胆胰疾病的诊疗，为患者解决胆道疾病、肝脏肿瘤、胰腺肿瘤等复杂问题'),
	('胃肠外科','胃肠道疾病的诊断与治疗，特别是在胃肠肿瘤的微创手术治疗方面有着丰富的经验和优势'),
	('骨科','处理各类骨科疾病，包括脊柱、关节疾病以及各类骨折等'),
	('泌尿外科','泌尿系统疾病的诊疗，如泌尿系结石、肿瘤、前列腺增生等'),
	('心胸外科','胸部疾病的诊断和治疗，包括肺癌、食管癌、纵隔肿瘤等复杂疾病'),
	('妇产科','提供全面的妇科和产科服务，包括孕前检查、孕期保健、分娩以及妇科疾病的诊断和治疗'),
	('儿科','儿童常见的呼吸道疾病、消化道疾病等，同时提供儿童疫苗接种和保健咨询等服务'),
	('眼科','处理眼部疾病和视力问题'),
	('耳鼻喉科','处理耳、鼻、喉等部位的疾病'),
	('口腔科','口腔疾病的诊断和治疗，如龋齿、牙周炎等'),
	('皮肤科','处理皮肤疾病和皮肤美容问题，提供皮肤检查、治疗和美容服务'),
	('肿瘤科','肿瘤疾病的早期诊断、治疗和康复指导，为患者提供全方位的肿瘤诊疗服务'),
	('中医科','为患者提供中医药治疗服务'),
	('疼痛科','慢性疼痛疾病的诊疗，治疗肌筋膜软组织疼痛、骨关节疼痛、脊柱源性疼痛、神经病理性疼痛、癌性疼痛等多种慢性疼痛');

SELECT * FROM tb_Department